title: File and Directory Creation on File Server
id: 96f5275e-6a81-4347-84e4-1b4775c05362
status: test
description: Detects the creation of new files and directories on a file server to monitor for suspicious activity.
author: Kenan Konjić
date: 2024-11-04
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 
      - 4663  # Object Access: Access attempt for a file or directory
      - 5145  # A network share object was accessed
    AccessMask|contains:
      - '0x2'  # Indicates a write operation
      - '0x4'  # Indicates create operation
    ObjectType|contains:
      - 'File'
      - 'Directory'
  condition: selection
fields:
  - EventID
  - ObjectName
  - SubjectUserName
  - IpAddress
  - AccessMask
level: medium
tags:
  - attack.t1071.001  # Application Layer Protocol: Web Protocols (if relevant)
  - data.exfiltration
  - file.creation
falsepositives:
  - Legitimate administrative activities